server/app/controllers/authentication_controller.rb

  def authenticate
    auth_token =
        AuthenticateUser.new(auth_params[:username], auth_params[:password]).call
        user = User.find_by(username: auth_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "revati"], ["LIMIT", 1]]