server/app/controllers/companies_controller.rb

  def indexall
    @companies = Company.all
---
SELECT "companies".* FROM "companies"

  def create
    @user.company.create!(company_params)
---
INSERT INTO "companies" ("company_name", "category_1", "category_2", "category_3", "about", "unique", "website", "user_id", "created_at", "updated_at", "logo_url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def set_user
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_user_company
    @company = @user.company.find_by!(id: params[:id]) if @user
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]