server/app/controllers/reviews_controller.rb

  def indexall
    @allreviews = Review.all
---
SELECT "reviews".* FROM "reviews"

  def index
    @company = Company.find(params[:company_id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @company = Company.find(params[:company_id])
    @review = @company.reviews.create!(review_params)
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "reviews" ("review", "company_id", "created_at", "updated_at", "user_id", "submitted_user", "submitted_company") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def show
    @company = Company.find(params[:company_id])
    @review = @company.reviews.find_by!(id: params[:id]) if @company
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."company_id" = $1 AND "reviews"."id" = $2 LIMIT $3  [["company_id", 2], ["id", 10], ["LIMIT", 1]]

  def update
    @company = Company.find(params[:company_id])
    @review = @company.reviews.find_by!(id: params[:id]) if @company
    @review.update(review_params)
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."company_id" = $1 AND "reviews"."id" = $2 LIMIT $3  [["company_id", 2], ["id", 9], ["LIMIT", 1]]
UPDATE "reviews" SET "user_id" = $1, "review" = $2, "updated_at" = $3 WHERE "reviews"."id" = $4  [["user_id", 1], ["review", "hello"], ["updated_at", "2020-02-18 22:30:11.286071"], ["id", 9]]

  def destroy
    @company = Company.find(params[:company_id])
    @review = @company.reviews.find_by!(id: params[:id]) if @company
    @review.destroy
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."company_id" = $1 AND "reviews"."id" = $2 LIMIT $3  [["company_id", 2], ["id", 10], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 11]]

  def set_company
    @company = Company.find(params[:company_id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_company_review
    @review = @company.reviews.find_by!(id: params[:id]) if @company
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."company_id" = $1 AND "reviews"."id" IS NULL LIMIT $2  [["company_id", 2], ["LIMIT", 1]]