server/app/controllers/users_controller.rb

  def create
    user = User.create!(user_params)
    auth_token = AuthenticateUser.new(user.username, user.password).call
    response = { message: Message.account_created, auth_token: auth_token }
    user_data = User.find_by(username: user.username)
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at", "email") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "revati20"], ["LIMIT", 1]]